#### Checkov 🧪`success`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Checkov Results</summary>

```



---
```

</details>

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.resource-group: Reading...
data.azurerm_resource_group.resource-group: Read complete after 0s [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod]
module.blazor-app.data.azurerm_resource_group.resource-group: Reading...
module.application-insights.data.azurerm_resource_group.resource-group: Reading...
module.sql-database.data.azurerm_resource_group.resource-group: Reading...
module.blazor-app.data.azurerm_resource_group.resource-group: Read complete after 0s [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod]
module.blazor-app.azurerm_service_plan.blazor-app-service-plan: Refreshing state... [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod/providers/Microsoft.Web/serverFarms/sp-mlb-prod]
module.sql-database.data.azurerm_resource_group.resource-group: Read complete after 0s [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod]
module.sql-database.azurerm_mssql_server.sql-server: Refreshing state... [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod/providers/Microsoft.Sql/servers/sql-mlb-prod]
module.application-insights.data.azurerm_resource_group.resource-group: Read complete after 0s [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod]
module.application-insights.azurerm_log_analytics_workspace.log-analytics: Refreshing state... [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod/providers/Microsoft.OperationalInsights/workspaces/log-mlb-prod]
module.application-insights.azurerm_application_insights.application-insights: Refreshing state... [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod/providers/Microsoft.Insights/components/ai-mlb-prod]
module.sql-database.azurerm_mssql_firewall_rule.allow-azure-accessazure: Refreshing state... [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod/providers/Microsoft.Sql/servers/sql-mlb-prod/firewallRules/AllowAzureAccess]
module.sql-database.azurerm_mssql_database.sql-database: Refreshing state... [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod/providers/Microsoft.Sql/servers/sql-mlb-prod/databases/sqldb-mlb-prod]
module.blazor-app.azurerm_windows_web_app.blazor-app: Refreshing state... [id=/subscriptions/8595f4ea-053f-4d5c-854b-6db01c741588/resourceGroups/rg-mlb-prod/providers/Microsoft.Web/sites/web-mlb-prod]
module.sql-database.mssql_user.sql-web-app-user: Refreshing state... [id=sqlserver://sql-mlb-prod.database.windows.net:1433/sqldb-mlb-prod/web-mlb-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sql-database.mssql_user.sql-web-app-user will be created
  + resource "mssql_user" "sql-web-app-user" {
      + authentication_type = (known after apply)
      + database            = "sqldb-mlb-prod"
      + default_schema      = "dbo"
      + id                  = (known after apply)
      + object_id           = "1797cc63-8bf1-46dc-853e-e25840a1c729"
      + principal_id        = (known after apply)
      + roles               = [
          + "db_datareader",
          + "db_datawriter",
        ]
      + sid                 = (known after apply)
      + username            = "web-mlb-prod"

      + server {
          + host = "sql-mlb-prod.database.windows.net"
          + port = "1433"

          + azuread_default_chain_auth {}
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @EtnMn, Action: `pull_request`, Workflow: `Check pull request`*